# Core CLI tools
brew "age"
brew "atuin"
brew "bat"
brew "chezmoi"
brew "coreutils"
brew "dust"
brew "eza"
brew "fd"
brew "fzf"
brew "gh"
brew "git"
brew "gopls"
brew "jq"
brew "lazydocker"
brew "lazygit"
brew "mise"
brew "neovim"
brew "postgresql@16"
brew "ripgrep"
brew "starship"
brew "tmux"
brew "tree-sitter"
brew "watch"
brew "wget"
brew "zoxide"
brew "zsh"

# Desktop applications
cask "1password"
cask "1password-cli"
cask "alacritty"
cask "docker"
cask "ghostty"
cask "localsend"
cask "obsidian"
cask "ollama"
cask "signal"
cask "typora"

# Fonts
cask "font-jetbrains-mono-nerd-font"
